In [1]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [2]:
train_data_initial = pd.read_csv("train.csv")
train_data_initial.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
train_data_initial.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
train_data = train_data_initial.copy()
train_data.drop(columns=['PassengerId'], inplace = True)
train_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test_data_initial = pd.read_csv("test.csv")
test_data = test_data_initial.copy()
test_data_initial.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
women = train_data.loc[train_data.Sex == 'female']["Survived"]
print("% of women who survived:", sum(women)/len(women))

men = train_data.loc[train_data.Sex == 'male']["Survived"]
print("% of men who survived:", sum(men)/len(men))  #this feature has a bit unical meaning and show correlation betwen values and survived - YES

% of women who survived: 0.7420382165605095
% of men who survived: 0.18890814558058924

In [7]:
train_data['Pclass'].value_counts() #this feature has a bit unical meaning and show correlation betwen values and survived - YES

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [8]:
class1 = train_data.loc[train_data.Pclass == 1]["Survived"]
print("% of class 1 who survived:", sum(class1)/len(class1))

class2 = train_data.loc[train_data.Pclass == 2]["Survived"]
print("% of class 2 who survived:", sum(class2)/len(class2))

class3 = train_data.loc[train_data.Pclass == 3]["Survived"]
print("% of class 3 who survived:", sum(class3)/len(class3))

% of class 1 who survived: 0.6296296296296297
% of class 2 who survived: 0.47282608695652173
% of class 3 who survived: 0.24236252545824846

In [9]:
train_data['Name'].value_counts()  #this feature has a lot of unical meaning  - NO

Braund, Mr. Owen Harris                     1
Boulos, Mr. Hanna                           1
Frolicher-Stehli, Mr. Maxmillian            1
Gilinski, Mr. Eliezer                       1
Murdlin, Mr. Joseph                         1
                                           ..
Kelly, Miss. Anna Katherine "Annie Kate"    1
McCoy, Mr. Bernard                          1
Johnson, Mr. William Cahoone Jr             1
Keane, Miss. Nora A                         1
Dooley, Mr. Patrick                         1
Name: Name, Length: 891, dtype: int64

In [10]:
train_data['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [11]:
portS = train_data.loc[train_data.Embarked == 'S']["Survived"]
print("% of port S who survived:", sum(portS)/len(portS))

portC = train_data.loc[train_data.Embarked == 'C']["Survived"]
print("% of port C who survived:", sum(portC)/len(portC))

portQ = train_data.loc[train_data.Embarked == 'Q']["Survived"]
print("% of port Q who survived:", sum(portQ)/len(portQ))  #this point hasn't correlation between meaning and % survived - NO

% of port S who survived: 0.33695652173913043
% of port C who survived: 0.5535714285714286
% of port Q who survived: 0.38961038961038963

In [12]:
train_data['Age'].value_counts() #split to main age groups - child, mature, elderly

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

In [13]:
child = train_data.loc[train_data.Age <= 18]["Survived"]
print("% of children who survived:", sum(child)/len(child))

mature = train_data.loc[(train_data.Age > 18) & (train_data.Age < 55)]["Survived"]
print("% of mature who survived:", sum(mature)/len(mature))

elderly = train_data.loc[train_data.Age >= 55]["Survived"]
print("% of elderly who survived:", sum(elderly)/len(elderly)) #we show correlation but classification is not clear - SO

% of children who survived: 0.5035971223021583
% of mature who survived: 0.3883677298311445
% of elderly who survived: 0.30952380952380953

In [14]:
train_data['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [15]:
alone = train_data.loc[train_data.SibSp == 0]["Survived"]
print("% of alone who survived:", sum(alone)/len(alone)) 

closers = train_data.loc[(train_data.SibSp == 1) ]["Survived"]
print("% of cloosers who survived:", sum(closers)/len(closers))

big = train_data.loc[train_data.SibSp >= 2]["Survived"]
print("% of big who survived:", sum(big)/len(big)) #not bad - SO

% of alone who survived: 0.34539473684210525
% of cloosers who survived: 0.5358851674641149
% of big who survived: 0.2702702702702703

In [16]:
train_data['Parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [17]:
himself = train_data.loc[train_data.Parch == 0]["Survived"]
print("% of 0 who survived:", sum(himself)/len(himself)) 

one = train_data.loc[train_data.Parch == 1]["Survived"]
print("% of 1 who survived:", sum(one)/len(one))

more = train_data.loc[train_data.Parch >= 2]["Survived"]
print("% of 2 and more who survived:", sum(more)/len(more)) #correlation is a little range - NO

% of 0 who survived: 0.34365781710914456
% of 1 who survived: 0.5508474576271186
% of 2 and more who survived: 0.4631578947368421

In [18]:
train_data['Fare'].value_counts() #big amount unical meanings and correlation with pclass - NO

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
35.0000     1
28.5000     1
6.2375      1
14.0000     1
10.5167     1
Name: Fare, Length: 248, dtype: int64

In [19]:
train_data.drop(columns=['Name', 'Parch', 'Fare', 'Cabin', 'Ticket'], inplace = True)
train_data.head()

   Survived  Pclass     Sex   Age  SibSp Embarked
0         0       3    male  22.0      1        S
1         1       1  female  38.0      1        C
2         1       3  female  26.0      0        S
3         1       1  female  35.0      1        S
4         0       3    male  35.0      0        S

In [20]:
train_data.loc[train_data['Sex'] == 'male', 'Sex'] = 1
train_data.loc[train_data['Sex'] == 'female', 'Sex'] = 2

train_data.loc[train_data['Embarked'] == 'S', 'Embarked'] = 1
train_data.loc[train_data['Embarked'] == 'C', 'Embarked'] = 2
train_data.loc[train_data['Embarked'] == 'Q', 'Embarked'] = 3

train_data.head(10)

   Survived  Pclass Sex   Age  SibSp Embarked
0         0       3   1  22.0      1        1
1         1       1   2  38.0      1        2
2         1       3   2  26.0      0        1
3         1       1   2  35.0      1        1
4         0       3   1  35.0      0        1
5         0       3   1   NaN      0        3
6         0       1   1  54.0      0        1
7         0       3   1   2.0      3        1
8         1       3   2  27.0      0        1
9         1       2   2  14.0      1        2

In [21]:
train_data['Age'] = train_data['Age']. fillna(train_data['Age'].mean())
train_data['Embarked'] = train_data['Embarked']. fillna(1)

In [22]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Embarked  891 non-null    int64
dtypes: float64(1), int64(4), object(1)
memory usage: 41.9+ KB

In [23]:
test_data.loc[test_data['Sex'] == 'male', 'Sex'] = 1
test_data.loc[test_data['Sex'] == 'female', 'Sex'] = 2

test_data.loc[test_data['Embarked'] == 'S', 'Embarked'] = 1
test_data.loc[test_data['Embarked'] == 'C', 'Embarked'] = 2
test_data.loc[test_data['Embarked'] == 'Q', 'Embarked'] = 3

test_data.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,3
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",2,47.0,1,0,363272,7.0000,NaN,1
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,3
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",2,22.0,1,1,3101298,12.2875,NaN,1
5,897,3,"Svensson, Mr. Johan Cervin",1,14.0,0,0,7538,9.2250,NaN,1
6,898,3,"Connolly, Miss. Kate",2,30.0,0,0,330972,7.6292,NaN,3
7,899,2,"Caldwell, Mr. Albert Francis",1,26.0,1,1,248738,29.0000,NaN,1
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",2,18.0,0,0,2657,7.2292,NaN,2
9,901,3,"Davies, Mr. John Samuel",1,21.0,2,0,A/4 48871,24.1500,NaN,1

In [24]:
test_data['Age'] = test_data['Age']. fillna(test_data['Age'].mean())
test_data.drop(columns=['PassengerId','Name', 'Parch', 'Fare', 'Cabin', 'Ticket'], inplace = True)
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Embarked  418 non-null    object
dtypes: float64(1), int64(2), object(2)
memory usage: 16.5+ KB

In [35]:
X = train_data.drop(columns='Survived')
y = train_data['Survived']

# Разделим данные на обучене и тест (как и раньше со стратификацией по таргету)
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=14, stratify=y, shuffle=True)

#features = ["Pclass", "Sex", "Age", "SibSp", "Embarked"]
#X_test_final = test_data

model = RandomForestClassifier(n_estimators=100, max_depth=6, random_state=1)
model.fit(X_train, y_train)

y_pred_test = model.predict(X_test)
print(f"Доля врено угаданных объектов {accuracy_score(y_test, y_pred_test)}")

predictions = model.predict(test_data)

output = pd.DataFrame({'PassengerId': test_data_initial.PassengerId, 'Survived': predictions})
output.to_csv('submission.csv', index=False)
print("Your submission was successfully saved!")

Доля врено угаданных объектов 0.8379888268156425
Your submission was successfully saved!